{
    "pinboard": {
        "usage": "%spinboard <in our out>",
        "description": "Sets the pinboard channels for the server. When both are set, each time a message is pinned in the `in` channel, it is posted to the `out` channel as a backup.",
        "args": {
            "in": "Sets the pinboard in channel.",
            "out": "Sets the pinboard out channel."
        }
    },
    "roleme": {
        "usage": "%sroleme <subcommand>",
        "description": "Commands for adding or removing roles to yourself.",
        "args": {
            "add": "(can also be used with just katze roleme) adds a role to yourself from the list of roleme roles.",
            "create": "(requires permissions) creates a blank role with the specified name and adds it to the list of roleme roles.",
            "disable": "removes a role from the list of roleme roles.",
            "enable": "adds a role to the list of roleme roles.",
            "list": "shows all the roleme roles in this server.",
            "remove": "removes a roleme role from yourself."
        }
    },
    "star": {
        "usage": "%sstar <subcommand>",
        "description": "Set of commands for interacting with the starboard.",
        "args": {
            "show": "<id> the id of a star to show in the current channel.",
            "stats": "show some statistics of the starboard in this server.",
            "who": "<id> show who starred a post."
        }
    },
    "starboard": {
        "usage": "%sstarboard <subcommand>",
        "description": "Set of commands for administering the starboard.",
        "args": {
            "channel": "sets the channel in which to post new stars. it is recommended to remove send message permissions from everyone but this bot. `none` to disable.",
            "emoji": "sets the emoji to treat as a star. send a :star: to reset."
        }
    },
    "avatar": {
        "usage": "%savatar [user]",
        "description": "Shows a full size avatar for yourself or a target user."
    },
    "delete": {
        "usage": "%sdelete <id>",
        "description": "Deletes an image from the rotation, and sends it back to you. To see images, type `katze list`."
    },
    "emojis": {
        "usage": "%semojis [all]",
        "description": "Shows the top 10 emojis used in the server in the last week, add `all` to see all of them."
    },
    "link": {
        "usage": "%slink <role id>",
        "description": "Link a role ID to an invite code. This bot must have the Create Instant Invite permission. use `katze roles` to see the role IDs for this server."
    },
    "list": {
        "description": "Shows all the images in this server's icon rotation."
    },
    "migratepins": {
        "description": "Using the pinboard in and pinboard out channels, send all pins from the in channel to the out channel as messages."
    },
    "owo": {
        "description": "Whats this owo"
    },
    "pin": {
        "usage": "%spin <id>",
        "description": "Force a message into the pinboard out channel from any channel. You must use this command in the same channel as the message."
    },
    "pls": {
        "usage": "%spls <image link or target user or upload an image>",
        "description": "Add an image to this server's icon rotation, and set it as the current icon."
    },
    "roles": {
        "description": "Show the list of roles in this server."
    },
    "rotate": {
        "description": "Change the server icon with one of the ones in the rotation. To see the list of images, type `katze list`."
    },
    "show": {
        "usage": "%sshow <id>",
        "description": "Shows a specific image from the rotation. To see the list of images, type `katze list`."
    },
    "timeout": {
        "usage": "%stimeout <hours>",
        "description": "Change how often the icon rotates. Can be any number between 1 and 24."
    },
    "count": {
        "usage": "%scount",
        "description": "Shows how many images are in this server's current rotation."
    },
    "pick": {
        "usage": "%spick <id>",
        "description": "Pick a specific image from the rotation as the server icon."
    },
    "what": {
        "usage": "%swat",
        "description": "Shows the fullsize version of the current icon."
    },
    "twig": {
        "usage": "%stwig",
        "description": "Enables display of extra images from embedded tweets."
    },
    "activity": {
        "usage": "%sactivity <role>",
        "description": "Sets the activity role for the server.\n\nThis role must be below the rohrkatze-rotator role in order to function properly. This role is assigned to a member whenever they type, and is removed after a little while. It persists longer the more messages that member sends."
    },
    "meme": {
        "usage": "%smeme",
        "description": "Toggles the current state of meme on the server. While this is on, the rotation has a 1/10 chance of displaying a fake notification badge."
    },
    "dont": {
        "usage": "%sdont",
        "description": "Toggles rotation of the server icon. While this is true, the icon will not rotate."
    },
    "cleanpins": {
        "usage": "%scleanpins",
        "description": "Toggles whether or not to clean the pins of the current pinboard in channel. While this is on, when a new message is pinned in the pinboard in channel, the oldest pin is removed."
    },
    "rolestate": {
        "usage": "%srolestate",
        "description": "Toggles rolestate for the server. While this is on, any time a user leaves the server, their roles are cached inside Katze's Redis server. If they join again and it is still on, their roles will be automatically reapplied."
    },
    "starmin": {
        "usage": "%starmin <number>",
        "description": "Sets the minimum amount of stars that a post needs to have for it to show up in the starboard."
    },
    "colorme": {
        "usage": "%scolorme <subcommand>",
        "description": "Commands for adding or removing colors to yourself.",
        "args": {
            "add": "(can also be used with just katze colorme) adds a role to yourself from the list of color roles.",
            "create": "(requires permissions) creates a blank color role with the specified name and hex color, and adds it to the list of color roles.",
            "list": "shows all the color roles in this server.",
            "remove": "removes a color role from yourself."
        }
    }
}
